articles/production-triangle.html

<p>So there is a concept I learned in the scene shop of theater, but
applies across multiple disciplines in various forms.  The one I
learned was called the "Production Triangle".
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Production Triangle</h2>
<div class="outline-text-2" id="text-1">

<pre class="example">

                     Time
                      /\
                     /  \
                    /    \
                   /      \
                  /        \
                 /----------\
             Quality       Money

</pre>


<p>
The basics of the triangle is that in any project you can have two out
of the three corners.  So there are effectively three different
permutations of this concept:
</p><ul>
<li>you can have something fast, and high quality, but it is going to
   take a lot of money
</li>
<li>you can have something high quality for cheap, but it will require
   a lot of time.
</li>
<li>you could have something fast and cheap, but it will be low
   quality.
</li>
</ul>


<p>
This is a concept that if people can think about it and understand it,
can save so much headache in planning and working with other people,
in particular if you are trying to work to execute their vision.  So
in theater, in the scene shop, explaining to the scenic designer why
they can't have everything their huge extravagant set requires.  Or
most recently for myself, when explaining to a client that has hired
me to design a sound system for them, why when you cut back on the
budget you are going to lose quality, as often times in that situation
the time variable is set, and cannot be changed.
</p></div>
</div>
